a-long-morning-walk-with-Nick.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://example.com/rss.xml"
      title="RSS feed for https://example.com/">
<title>A Long Morning Walk with Nick</title>
</head>
<body>
<div id="preamble" class="status"></div>
<div id="content">
<div class="post-date">09 Sep 2016</div><h1 class="post-title"><a href="https://example.com/a-long-morning-walk-with-Nick.html">A Long Morning Walk with Nick</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfb1551f">1. A long Morning Walk with Nick</a></li>
</ul>
</div>
</nav>
<div id="outline-container-orgfb1551f" class="outline-2">
<h2 id="orgfb1551f"><span class="section-number-2">1.</span> A long Morning Walk with Nick</h2>
<div class="outline-text-2" id="text-1">
<p>
Nick, my Seeing Eye dog, and I took a walk this morning.
</p>

<p>
Now I know that taking a walk with your dog is not a novel experience for any dog owner. What was significant about this walk was that it took place immediately after my breakfast and before my exercise class at the senior center.
</p>

<p>
Normally I would have listened to my podcast app while sucking down at least one large cup of coffee. Instead, I skipped my morning coffee and got walking.
</p>

<p>
Our walk lasted about 40 minutes. We walked a route we just learned from our friend Sandy, but we walked it backwards. Nick trotted right along and got very excited when I chose to walk on the other side of Terrace Avenue. Nick had not walked down this side of the street yet.
</p>

<p>
I'm not sure how long the route is, maybe over 2 miles.
</p>

<p>
We have not been able to walk for several days because of our schedule and the rain. As it was not raining and it was fairly cool, it was a wonderful time to walk.
</p>
</div>
</div>
<div class="taglist"></div></div>
<div id="postamble" class="status"></div>
</body>
</html>
